Управление_торговлей_115_демо_.Teklifo/src/InformationRegisters/TK_СоответствиеОрганизацийTeklifo/TK_СоответствиеОрганизацийTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TK_СоответствиеОрганизацийTeklifo</name>
  <resources>
    <name>ИдентификаторОрганизацииTeklifo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.TK_УчетныеЗаписиTeklfio</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_115_демо_.Teklifo/src/InformationRegisters/TK_ИдентификаторыЗапросовЦенПоставщикамНаTeklifo/TK_ИдентификаторыЗапросовЦенПоставщикамНаTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TK_ИдентификаторыЗапросовЦенПоставщикамНаTeklifo</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАктуальнаяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенПоставщикам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_115_демо_.Teklifo/src/InformationRegisters/TK_ИдентификаторыЗапросовЦенОтКлиентовНаTeklifo/TK_ИдентификаторыЗапросовЦенОтКлиентовНаTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TK_ИдентификаторыЗапросовЦенОтКлиентовНаTeklifo</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАктуальнаяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенОтКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_115_демо_.Teklifo/src/InformationRegisters/TK_СтатусыПубликацииЗапросовЦенПоставщикамНаTeklifo/TK_СтатусыПубликацииЗапросовЦенПоставщикамНаTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TK_СтатусыПубликацииЗапросовЦенПоставщикамНаTeklifo</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.TK_СтатусыПубликацииЗапросовЦен</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенПоставщикам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_115_демо_.Teklifo/src/Enums/TK_СтатусыПубликацииЗапросовЦен/TK_СтатусыПубликацииЗапросовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TK_СтатусыПубликацииЗапросовЦен</name>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>НеОпубликован</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОбновление</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенОтКлиента/TK_ЗапросЦенОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_ЗапросЦенОтКлиента</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.TK_ТипыЗапросовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/CommonModules/TK_ОбщегоНазначенияВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает список организаций для которых настроена интеграция с Teklifo.
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.Организации - доступные для интеграции организации
Функция ОрганизацииДоступныеКОбменуСTeklifo() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	TK_СоответствияОрганизаций.Организация
						  |ИЗ
						  |	РегистрСведений.TK_СоответствиеОрганизацийTeklifo КАК TK_СоответствияОрганизаций
						  |СГРУППИРОВАТЬ ПО
						  |	TK_СоответствияОрганизаций.Организация");

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат.ВыгрузитьКолонку("Организация");

КонецФункции

// Возвращает URL публикации документа на сервисе Teklifo.
// 
// Параметры:
//  Документ - ДокументСсылка.TK_ЗапросЦенПоставщикам - Ссылка на документ
// 
// Возвращаемое значение:
//  Строка - URL публикации документа
Функция ВнешняяСсылкаНаОпубликованныйДокумент(Документ) Экспорт

	ДанныеПубликации = ДанныеОпубликованногоЗапросаЦенПоставщикам(Документ);

	СсылкаДляЗапуска = "";

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.TK_ЗапросЦенПоставщикам") И ЗначениеЗаполнено(
		ДанныеПубликации.Идентификатор) Тогда
		СсылкаДляЗапуска = СтрШаблон("https://teklifo.com/rfq/%1", ДанныеПубликации.Идентификатор);
	КонецЕсли;

	Возврат СсылкаДляЗапуска;

КонецФункции

// Возвращает данные опубликованного запроса цен поставщикам.
// 
// Параметры:
//  Документ - ДокументСсылка.TK_ЗапросЦенПоставщикам - Ссылка на запрос цен поставщикам
// 
// Возвращаемое значение:
//  Структура - Получить данные документа:
// * Идентификатор - Строка
// * НомерДокумента - Строка
Функция ДанныеОпубликованногоЗапросаЦенПоставщикам(Документ) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ИдентификаторыЗапросовЦен.Идентификатор,
						  |	ИдентификаторыЗапросовЦен.НомерДокумента
						  |ИЗ
						  |	РегистрСведений.TK_ИдентификаторыЗапросовЦенПоставщикамНаTeklifo КАК ИдентификаторыЗапросовЦен
						  |ГДЕ
						  |	ИдентификаторыЗапросовЦен.Документ = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	СтруктураДанных = Новый Структура("Идентификатор, НомерДокумента", "", "");
	Если Выборка.Количество() > 0 Тогда
		СтруктураДанных.Идентификатор = Выборка.Идентификатор;
		СтруктураДанных.НомерДокумента = Выборка.НомерДокумента;
	КонецЕсли;

	Возврат СтруктураДанных;

КонецФункции

// Возвращает данные опубликованного запроса цен от клиента по идентификатору версии.
// 
// Параметры:
//  ИдентификаторВерсии - Строка - идентификатор версии опубликованного документа
// 
// Возвращаемое значение:
//  ДокументСсылка.TK_ЗапросЦенОтКлиента
Функция ЗапросЦенОтКлиентаПоИдентификаторуВерсии(ИдентификаторВерсии) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	TK_СоответствияДокументовЗапросаЦенОтКлиентов.Документ
						  |ИЗ
						  |	РегистрСведений.TK_ИдентификаторыЗапросовЦенОтКлиентовНаTeklifo КАК TK_СоответствияДокументовЗапросаЦенОтКлиентов
						  |ГДЕ
						  |	TK_СоответствияДокументовЗапросаЦенОтКлиентов.ИдентификаторВерсии = &ИдентификаторВерсии");
	Запрос.УстановитьПараметр("ИдентификаторВерсии", ИдентификаторВерсии);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	КонецЕсли;

	Возврат Документы.TK_ЗапросЦенОтКлиента.ПустаяСсылка();

КонецФункции

// Возвращает актуальный статус публикации документа на Teklifo.
// 
// Параметры:
//  Документ - ДокументСсылка.TK_ЗапросЦенПоставщикам - Ссылка на заказ
// 
// Возвращаемое значение:
// 	ПеречислениеСсылка.TK_СтатусыПубликацииЗапросовЦен 
Функция СтатусПубликацииДокумента(Документ) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	TK_СтатусыДокументовИнтеграцииСрезПоследних.Статус
						  |ИЗ
						  |	РегистрСведений.TK_СтатусыПубликацииЗапросовЦенПоставщикамНаTeklifo.СрезПоследних(, Документ = &Документ) КАК
						  |		TK_СтатусыДокументовИнтеграцииСрезПоследних");
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	Иначе
		Возврат Перечисления.TK_СтатусыПубликацииЗапросовЦен.НеОпубликован;
	КонецЕсли;

КонецФункции

// Устанавливает статус публикации запроса цен поставщикам.
// 
// Параметры:
//  Документ - ДокументСсылка.TK_ЗапросЦенПоставщикам - Ссылка на заказ
//  Статус - ПеречислениеСсылка.TK_СтатусыПубликацииЗапросовЦен - Статус
Процедура УстановитьСтатусПубликацииЗаказаЦенПоставщикам(Документ, Статус) Экспорт

	МенеджерЗаписи = РегистрыСведений.TK_СтатусыПубликацииЗапросовЦенПоставщикамНаTeklifo.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Записать();

КонецПроцедуры

#КонецОбласти
